Revit 2027 API
RevisionNumberingSequence.HasValidAlphanumericRevisionSettings Method
 Checks whether the revision numbering sequence owns a valid alphanumeric revision settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValidAlphanumericRevisionSettings()
Public Function HasValidAlphanumericRevisionSettings As Boolean
public:
bool HasValidAlphanumericRevisionSettings()
member HasValidAlphanumericRevisionSettings : unit -> bool
Return Value
Boolean
 True if the revision numbering sequence owns a valid alphanumeric revision settings.
See Also
Reference
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace